app/views/dnasamples/show.html.erb

SELECT "taxonomies".* FROM "taxonomies" INNER JOIN "dnasamples_taxonomies" ON "taxonomies"."id" = "dnasamples_taxonomies"."taxonomy_id" WHERE "dnasamples_taxonomies"."dnasample_id" = 1
---
				<b>Belongs to the following Taxonomy Record </b><br>
				<%= @dnasample.taxonomies.collect{|taxa|[taxa.id,taxa.family,taxa.genus,taxa.species,taxa.subspecies].join(" ")} %>

SELECT "genes".* FROM "genes"
---
<%= form_tag(:action => "submitgene") do %>
<p>	<%= select('dnasample','genes',Gene.all.collect {|p| [ p.genbank, p.id] }, {:prompt => 'Select Gene'})%> Select a Gene by its Genbank ID in the <%= link_to "Genes", genes_path %> table.</p>