app/controllers/dnasamples_controller.rb

SELECT "dnasamples".* FROM "dnasamples" ORDER BY updated_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "dnasamples"
---
   def index
		@per_page = params[:per_page]  ||= 10

       	@dnasamples=Dnasample.paginate(:page => params[:page], :per_page=>@per_page)

SELECT "dnasamples".* FROM "dnasamples" WHERE "dnasamples"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @dnasample = Dnasample.find(params[:id])

SELECT "dnasamples".* FROM "dnasamples" WHERE "dnasamples"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit

    @dnasample = Dnasample.find(params[:id])

INSERT INTO "dnasamples" ("collector_number", "created_at", "created_by", "date", "dna_accession", "dnasample_number", "extraction_notes", "first_elution_volume", "location_collected", "method", "museum", "reextracted", "sample_type", "second_elute", "second_elution_volume", "specimen_gender", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", ""]]
---
  def create
    	# if (params[:dnasample][:taxonomies]!='')
    	#     		params[:dnasample][:taxonomies]=[Taxonomy.find(params[:dnasample][:taxonomies])]
    	#     	else
    	# 			flash[:error] = "Must choose an existing Taxonomy"
    	#     		params[:dnasample][:taxonomies]=[]
    	#     	end
		# if (params[:dnasample][:projects]!='')
		# 		    		params[:dnasample][:projects]=[Project.find(params[:dnasample][:projects])]
		# 		    	else
		# 					flash[:error] = "Must Choose an existing Project"
		# 		    		params[:dnasample][:projects]=[]
		# 		    	end
        @dnasample = Dnasample.new(params[:dnasample])
		@dnasample.attributes={:projects=>(@dnasample.projects<<(Project.find(params[:projects][:id])))}

SELECT "dnasamples".* FROM "dnasamples" WHERE "dnasamples"."id" = ? LIMIT 1  [["id", "74"]]
UPDATE "dnasamples" SET "updated_at" = '2011-01-26 20:44:54', "dna_accession" = 'test' WHERE "id" = 1
---
  def update
	# dna.attributes={:projects=>(dna.projects<<pro)}
	p params
    @dnasample = Dnasample.find(params[:id])
	# if (params[:projects][:id]!='')
	# 	@dnasample.attributes<<{:projects=>(@dnasample.projects<<(Project.find(params[:projects][:id])))}
	# end
	if (params[:taxonomy][:id]!='')
		# @dnasample.attributes={:taxonomy=>(@dnasample.taxonomy=(Taxonomy.find(params[:taxonomy][:id])))}
		@taxonomy=(Taxonomy.find(params[:taxonomy][:id]))
		puts @taxonomy.inspect
		puts @dnasample.taxonomy
		@dnasample.taxonomy=@taxonomy
		@dnasample.save

SELECT * FROM "dnasamples" WHERE ("dnasamples"."id" = 1)
DELETE FROM "dnasamples" WHERE "id" = 1
---
  def destroy
    @dnasample = Dnasample.find(params[:id])
    @dnasample.destroy