app/controllers/experiments_controller.rb

SELECT * FROM "experiments" WHERE ((experiments.experiment_number LIKE '%odio%') OR (experiments.date LIKE '%odio%') OR (experiments.anneal LIKE '%odio%') OR (experiments.dna_amount LIKE '%odio%') OR (experiments.total_samples LIKE '%odio%') OR (experiments.notes LIKE '%odio%') OR (experiments.bsa LIKE '%odio%') OR (experiments.buffer LIKE '%odio%') OR (experiments.mgcl2 LIKE '%odio%') OR (experiments.taq LIKE '%odio%') OR (experiments.dntps LIKE '%odio%') OR (experiments.dna LIKE '%odio%') OR (experiments.primerl_amount LIKE '%odio%') OR (experiments.primerh_amount LIKE '%odio%') OR (experiments.total LIKE '%odio%') OR (experiments.primerl LIKE '%odio%') OR (experiments.primerh LIKE '%odio%')) ORDER BY experiment_number asc
---
  def index


     @per_page = params[:per_page] || Experiment.per_page || 10
      @search=Experiment.search(params[:search])

SELECT * FROM "experiments" WHERE ("experiments"."id" = 1)
SELECT * FROM "experiments" ORDER BY experiments.id DESC LIMIT 1
SELECT * FROM "pcrs" INNER JOIN "experiments_pcrs" ON "pcrs".id = "experiments_pcrs".pcr_id WHERE ("experiments_pcrs".experiment_id = 278 )
SELECT * FROM "dnasamples" INNER JOIN "dnasamples_pcrs" ON "dnasamples".id = "dnasamples_pcrs".dnasample_id WHERE ("dnasamples_pcrs".pcr_id = 2 )
---
  def show
    @ids=Array.new
    @pcrsAll=Pcr.find(:all)
    @dnasamples=Dnasample.find(:all)
    @pcrs=Hash.new
    @experiments=Experiment.find(:all, :limit=>15 )
    @experiment=Experiment.find(params[:id])
    @experiment.pcrs.each do |pcr|
      @pcrs[pcr]=pcr.dnasamples.first

SELECT * FROM "experiments" WHERE ("experiments"."id" = 2)
---
  def edit
    @experiment = Experiment.find(params[:id])

INSERT INTO "experiments" ("dna", "primerh", "created_at", "buffer", "notes", "updated_at", "dna_amount", "experiment_number", "taq", "dntps", "primerh_amount", "total", "date", "total_samples", "bsa", "h2o", "primerl", "anneal", "mgcl2", "primerl_amount") VALUES('', '', '2011-01-26 21:04:03', '', '', '2011-01-26 21:04:03', NULL, '', '', '', NULL, NULL, '2011-01-26', NULL, '', '', '', 0.0, '', NULL)
---
  def create
    @experiment = Experiment.new(params[:experiment])

    if params[:gene][:primer]!=""
        @primer=Primer.find(params[:gene][:primer])
        @experiment.primerh=@primer.primerh
        @experiment.primerl=@primer.primerl
    end
    respond_to do |format|
      if @experiment.save

SELECT * FROM "experiments" WHERE ("experiments"."id" = 2)
UPDATE "experiments" SET "updated_at" = '2011-01-26 23:59:25', "experiment_number" = '1' WHERE "id" = 2
---
  def update
    @experiment = Experiment.find(params[:id])
     if params[:gene][:primer]!=""
        @primer=Primer.find(params[:gene][:primer])
        @experiment.primerh=@primer.primerh
        @experiment.primerl=@primer.primerl
    end

    respond_to do |format|
      if @experiment.update_attributes(params[:experiment])

SELECT * FROM "experiments" WHERE ("experiments"."id" = 1)
DELETE FROM "experiments" WHERE "id" = 1
---
  def destroy
    @experiment = Experiment.find(params[:id])
    @experiment.destroy

SELECT * FROM "experiments" WHERE ("experiments"."id" = 2)
---
  def updatepcr
    experiment=Experiment.find(params[:id])

SELECT * FROM "pcrs" WHERE ("pcrs"."id" = 2)
SELECT * FROM "dnasamples" INNER JOIN "dnasamples_pcrs" ON "dnasamples".id = "dnasamples_pcrs".dnasample_id WHERE ("dnasamples_pcrs".pcr_id = 23 )
---
  def updatednasamples
    experiment=Experiment.find(278)
    logger.debug "update sample id is #{params[:id]}"
    pcr=Pcr.find(params[:id])
    @dnasamples=Array.new
    pcr.dnasamples.each do |dna|