app/controllers/genes_controller.rb

  def index
    @genes = Gene.all
---
SELECT * FROM "genes"

  def show
    @gene = Gene.find(params[:id])
---
SELECT * FROM "genes" WHERE ("genes"."id" = 1)

  def edit
    @gene = Gene.find(params[:id])
---
SELECT * FROM "genes" WHERE ("genes"."id" = 980190962)

  def create
    @gene = Gene.new(params[:gene])

      if params[:gene][:primer]!=""
        @primer=Primer.find(params[:gene][:primer])
        @gene.primerh=@primer.primerh
        @gene.primerl=@primer.primerl
    end
    respond_to do |format|
      if @gene.save
---
INSERT INTO "genes" ("genbank", "primerh", "created_at", "updated_at", "primerl", "locus") VALUES('test', '', '2011-01-26 20:47:12', '2011-01-26 20:47:12', '', '')

  def update
    @gene = Gene.find(params[:id])
---
SELECT * FROM "genes" WHERE ("genes"."id" = 980190962)

  def destroy
    @gene = Gene.find(params[:id])
    @gene.destroy
---
SELECT * FROM "genes" WHERE ("genes"."id" = 1)
DELETE FROM "genes" WHERE "id" = 1