app/controllers/pcrs_controller.rb

SELECT * FROM "pcrs"
---
  def index
		if params[:term]
			@pcrs=Pcr.search(params[:term])

SELECT * FROM "pcrs" WHERE ("pcrs"."id" = 1)
---
  def show
    @pcr = Pcr.find(params[:id])

SELECT * FROM "pcrs" WHERE ("pcrs"."id" = 980190962)
---
  def edit
    @pcr = Pcr.find(params[:id])

INSERT INTO "pcrs" ("gel_image", "denature", "primerh", "created_at", "conditions", "total_worked", "extension", "notes", "updated_at", "anneal_temp", "dna_amount", "date", "total_samples", "primerl", "pcr_tube_number", "cycle", "reamp") VALUES('', NULL, '', '2011-01-26 21:03:47', '', NULL, NULL, '', '2011-01-26 21:03:47', NULL, NULL, '2011-01-26', NULL, '', 'testpcr', NULL, '')
---
  def create


	@pcr = Pcr.new(params[:pcr])
	# if(params[:tube][:id])
	# 	@pcr.attributes={:tube=>@pcr.tube=(Tube.find(params[:tube][:id]))}
	# else
	# 	flash[:error] = "Must choose tube"
	# end
    respond_to do |format|
      if params[:dnasample][:id]
        @pcr.dnasample_id=params[:dnasample][:id]
      end

      if @pcr.save

SELECT * FROM "pcrs" WHERE ("pcrs"."id" = 980190962)
---
	def update
 		@pcr = Pcr.find(params[:id])

SELECT * FROM "pcrs" WHERE ("pcrs"."id" = 1)
DELETE FROM "pcrs" WHERE "id" = 1
---
  def destroy
    @pcr = Pcr.find(params[:id])
    @pcr.destroy