app/controllers/projects_controller.rb

INSERT INTO "projects" ("anneal", "bsa", "buffer", "created_at", "date", "dna", "dna_amount", "dntps", "h2o", "mgcl2", "notes", "primerh", "primerh_amount", "primerl", "primerl_amount", "project_name", "taq", "total", "total_samples", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @project = Project.new(params[:project])

    # if params[:gene][:primer]!=""
    #         @primer=Primer.find(params[:gene][:primer])
    #         @project.primerh=@primer.primerh
    #         @project.primerl=@primer.primerl
    #     end

    respond_to do |format|
      if @project.save