app/controllers/taxonomies_controller.rb

  def index
    @per_page = params[:per_page] || 20

		if params[:term]

			@taxonomies=Taxonomy.search(params[:term])
---
SELECT * FROM "taxonomies" WHERE (taxonomies.id LIKE '%%') ORDER BY genus asc

  def show
    @taxonomy = Taxonomy.find(params[:id])
---
SELECT * FROM "taxonomies" WHERE ("taxonomies"."id" = 1)

  def edit
    @taxonomy = Taxonomy.find(params[:id])
---
SELECT * FROM "taxonomies" WHERE ("taxonomies"."id" = 794)

  def create
    @taxonomy = Taxonomy.new(params[:taxonomy])

    respond_to do |format|
      if @taxonomy.save
---
INSERT INTO "taxonomies" ("reference", "countries", "type_museum", "created_at", "updated_at", "synonyms", "other_literature", "character_diagnosis", "family", "description_pdf", "ingroup", "genus", "subspecies", "distribution", "description", "new_diagnosis", "species") VALUES('', '', '', '2011-01-26 21:02:45', '2011-01-26 21:02:45', '', '', '', '', '', '', 'test', '', '', '', '', '')

  def update
    @taxonomy = Taxonomy.find(params[:id])
---
SELECT * FROM "taxonomies" WHERE ("taxonomies"."id" = 980190962)

  def destroy
    @taxonomy = Taxonomy.find(params[:id])
    @taxonomy.destroy
---
SELECT * FROM "taxonomies" WHERE ("taxonomies"."id" = 1)
DELETE FROM "taxonomies" WHERE "id" = 1