app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('QSvVI3HGN35sjFNkI64Z', '2011-03-07 05:34:52', '2011-03-07 05:34:52', 'd784f89a789ed7761a2912ab8d8faeab0f8137a9a33a34057abb3980801fe933e62a9bc7ca14e687d66a8c3e4b98508ee196c23734956ede97f2f1ec88aca6b7', 'tuQTsJIZ86uUUYHLS5nA', '2011-03-07 05:34:52', 0, '127.0.0.1', '9EVyJ5ymPxntnBPj', '2011-03-07 05:34:51', 'b8a393bcc9ea739eb7819c03cd01e3d3c00d83b56778a3061b465f0826e09467627e02172d7a349683c2f6c4220468baafcf7616655169faf14b4de33525f284', 1, NULL, 'admin', NULL, 'rick@rickschmidt.org')
---
  def create
    @user = User.new(params[:user])
    if @user.save